app/Model/Bed.php

    public function isFilled($id)
    {
        $argc = PatientInOut::where([
            'bed_id' => $id,
            'type' => 'ipd',
            'discharged' => false,
        ])->first();
---
select * from `patient_in_outs` where (`bed_id` = 1 and `type` = 'ipd' and `discharged` = 0) limit 1