app/Http/Controllers/HomeController.php

select * from `beds`
---
    public function bedstatus()
    {

        $beds = Bed::all()->groupBy(['floor', 'ward']);