app/Http/Controllers/Backend/Admin/StaffController.php

select * from `staff`
---
    public function index()
    {
        $staffs = Staff::latest()->get();